In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
from sklearn import linear_model as lm

In [2]:
df = pd.read_csv('canada.csv')
df.head()

   year  per capita income (US$)
0  1970              3399.299037
1  1971              3768.297935
2  1972              4251.175484
3  1973              4804.463248
4  1974              5576.514583

In [3]:
Year = df['year'].reset_index()
Year.drop(columns=['index'], inplace=True)
Year.set_index(df.year)

      year
year
1970  1970
1971  1971
1972  1972
1973  1973
1974  1974
1975  1975
1976  1976
1977  1977
1978  1978
1979  1979
1980  1980
1981  1981
1982  1982
1983  1983
1984  1984
1985  1985
1986  1986
1987  1987
1988  1988
1989  1989
1990  1990
1991  1991
1992  1992
1993  1993
1994  1994
1995  1995
1996  1996
1997  1997
1998  1998
1999  1999
2000  2000
2001  2001
2002  2002
2003  2003
2004  2004
2005  2005
2006  2006
2007  2007
2008  2008
2009  2009
2010  2010
2011  2011
2012  2012
2013  2013
2014  2014
2015  2015
2016  2016

In [4]:
Year

    year
0   1970
1   1971
2   1972
3   1973
4   1974
5   1975
6   1976
7   1977
8   1978
9   1979
10  1980
11  1981
12  1982
13  1983
14  1984
15  1985
16  1986
17  1987
18  1988
19  1989
20  1990
21  1991
22  1992
23  1993
24  1994
25  1995
26  1996
27  1997
28  1998
29  1999
30  2000
31  2001
32  2002
33  2003
34  2004
35  2005
36  2006
37  2007
38  2008
39  2009
40  2010
41  2011
42  2012
43  2013
44  2014
45  2015
46  2016

In [ ]:
plt()